#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
[0m[1mmodule.Team_Creation.github_team.main[0]: Refreshing state... [id=4784942][0m
[0m[1mmodule.Team_Creation.github_membership.membership_for_some_user[0]: Refreshing state... [id=epsi-tf-exam-ale:skhedim][0m
[0m[1mmodule.Team_Creation.github_repository.REPO: Refreshing state... [id=Test][0m
[0m[1mmodule.Team_Creation.github_team_membership.some_team_membership["0.0"]: Refreshing state... [id=4784942:skhedim][0m
[0m[1mmodule.Team_Creation.github_team_membership.some_team_membership["0.1"]: Refreshing state... [id=4784942:Salombo][0m
[0m[1mmodule.Team_Creation.github_repository_collaborator.repo_collaborators[1]: Refreshing state... [id=Test:Salombo][0m
[0m[1mmodule.Team_Creation.github_team_repository.some_team_repo[0]: Refreshing state... [id=4784942:Test][0m
[0m[1mmodule.Team_Creation.github_repository_collaborator.repo_collaborators[0]: Refreshing state... [id=Test:skhedim][0m
[0m[1mmodule.Team_Creation.github_branch_protection_v3.example: Refreshing state... [id=Test:main][0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
  [31m-[0m destroy
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # module.Team_Creation.github_branch_protection_v3.example[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "github_branch_protection_v3" "example" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "W/\"6d8a8177624b2ee479e54eb8f1b1cd19c8db2d5d1d186657a98e7c2bf08783b9\"" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                     = "Test:main" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mrepository[0m[0m             = "Test" [33m->[0m [0m"Test123" [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mrestrictions {
          [31m-[0m [0m[1m[0mapps[0m[0m  = [] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mteams[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0musers[0m[0m = [] [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # module.Team_Creation.github_membership.membership_for_some_user[0][0m will be [1m[31mdestroyed[0m[0m
[0m  [31m-[0m[0m resource "github_membership" "membership_for_some_user" {
      [31m-[0m [0m[1m[0metag[0m[0m     = "W/\"181461f68a07decca379afa1cb22ea0a36a733379a496beb8ebadc6dafa5b4c3\"" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m       = "epsi-tf-exam-ale:skhedim" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mrole[0m[0m     = "member" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0musername[0m[0m = "skhedim" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # module.Team_Creation.github_repository.REPO[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "github_repository" "REPO" {
        [1m[0mid[0m[0m                     = "Test"
      [33m~[0m [0m[1m[0mname[0m[0m                   = "Test" [33m->[0m [0m"Test123"
      [33m~[0m [0m[1m[0mvulnerability_alerts[0m[0m   = false [33m->[0m [0mtrue
        [90m# (25 unchanged attributes hidden)[0m[0m
    }

[1m  # module.Team_Creation.github_repository_collaborator.repo_collaborators[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "github_repository_collaborator" "repo_collaborators" {
      [33m~[0m [0m[1m[0mid[0m[0m                          = "Test:skhedim" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minvitation_id[0m[0m               = "45775769" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpermission[0m[0m                  = "pull" [33m->[0m [0m"push" [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.Team_Creation.github_team.main[0][0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "github_team" "main" {
      [33m~[0m [0m[1m[0mdescription[0m[0m               = "La team 3" [33m->[0m [0m"La team 34"
        [1m[0mid[0m[0m                        = "4784942"
      [33m~[0m [0m[1m[0mname[0m[0m                      = "TEAM3" [33m->[0m [0m"TEAM34"
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.Team_Creation.github_team_membership.some_team_membership["0.1"][0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "github_team_membership" "some_team_membership" {
        [1m[0mid[0m[0m       = "4784942:Salombo"
      [33m~[0m [0m[1m[0mrole[0m[0m     = "maintainer" [33m->[0m [0m"member"
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.Team_Creation.github_team_repository.some_team_repo[0][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "github_team_repository" "some_team_repo" {
      [33m~[0m [0m[1m[0metag[0m[0m       = "W/\"035e65e401064f2408eebbc2eb11aab6641622a890fd78430c6993419cf47995\"" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m         = "4784942:Test" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mrepository[0m[0m = "Test" [33m->[0m [0m"Test123" [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 3 to add, 3 to change, 4 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @Salombo, Action: `pull_request`*